# ДЗ 4 Циклы, кортежи, списки
##################################################
print()

##################################################
# Что будет выведено на экран в результате выполнения
# данной программы:
values=[1,2,3,4,5]
print("1.", type(values))
# 1. <class 'list'>

##################################################
# Что будет выведено на экран в результате выполнения
# данной программы:
values=(1,2,3,4,5)
print("2.", type(values))
# 2.  <class 'tuple'>

##################################################
# Что будет выведено на экран в результате выполнения
# данной программы:
values=(1,2,3,4,5)
values=list(values)
print("3.", type(values))
# 3. <class 'list'>

print()
##################################################
values=[1,2,3,4,5]
values=tuple(values)
print("4.", type(values))
# 4. <class 'tuple'>

##################################################
values=[1,2,3,4,5]
result=[]

for value in values:
    result.append(value)

print("5.", result)
# 5. [1, 2, 3, 4, 5]

##################################################
values = [1, 2, 3, 4, 5]
result = []

for value in values[::-1]:
      result.append(value)

print("6.", result)
# 6. [5, 4, 3, 2, 1]
print()
##################################################

values = [1,2,3,4,5]

print("7.", len(values))
# 7. 5

##################################################
values = [1,2,3,4,5]
new_value = values + values[::-1]
print("8.", new_value)
# 8. [1, 2, 3, 4, 5, 5, 4, 3, 2, 1]

##################################################

values = [1,2,3,4,5]
new_value = values
new_value.append(6)
print("9.", values)
# 9. [1, 2, 3, 4, 5, 6]
print()
##################################################

values = [1,2,3,4,5]
new_value = values.copy()
new_value.append(6)
print("10.", values)
# 10. [1, 2, 3, 4, 5]

##################################################

values=[0]*6
values[0]=1
print("11.",values)
# 11. [1, 0, 0, 0, 0, 0]

##################################################

value= 0
values = [value]*6
value=1
print("12.", values)
# 12. [0, 0, 0, 0, 0, 0]

print()
##################################################

my_list = [0]
# print("my_list = [0]  :", my_list)
values = [my_list]*3
# print("values = [my_list]*3  :",values)
print("13.", values)
# 13. [[0], [0], [0]]

##################################################
my_list = [0]
# print("my_list = [0]  :", my_list)
values = [my_list]*3
# print("values = [my_list]*3  :",values)
my_list.append(1)
# print("my_list.append(1)  :",my_list)
print("14.", values)
# 14. [[0, 1], [0, 1], [0, 1]]

##################################################
my_list = [0]
values = [my_list.copy()]*3
my_list.append(1)
print("15.",values)
# 15. [[0], [0], [0]]

print()
##################################################
my_list = ["a", "b", "c","d", "e", "f"]
my_str = " ".join(my_list)
print("16.",my_str)
# 16. a b c d e f

##################################################
my_list = ["a", "b", "c","d", "e", "f"]
my_str = "_".join(my_list)
print("17.",my_str)
# 17. a_b_c_d_e_f

##################################################
my_list = ["a", "b", "c", "d", "e", "f"]
my_str = "_".join(my_list[::-1])
print("18.",my_str)
# 18. f_e_d_c_b_a

##################################################
my_list = ["a", "b", "c","d", "e", "f"]
my_str = "".join(my_list[::2])
print("19.",my_str)
# 19. ace
##################################################
