# ДЗ 4 Циклы, кортежи, списки
##################################################
print('1. Что будет выведено на экран в результате '
      'выполнения данной программы:')
print('     values=[1,2,3,4,5,6]')
print('     print(type(values)) ?')
values=[1,2,3,4,5,6]
print("1. На экране выведено:", type(values))
##################################################
print('2. Что будет выведено на экран в результате '
      'выполнения данной программы:')
print('     values=(1,2,3,4,5,6)')
print('     print(type(values)) ?')
values=(1,2,3,4,5,6)
print("2. На экране выведено:", type(values))
##################################################
print('3. Что будет выведено на экран в результате '
      'выполнения данной программы:')
print('     values=(1,2,3,4,5,6)')
print('     values=list(values)')
print('     print(type(values)) ?')
values=(1,2,3,4,5,6)
values=list(values)
print("3. На экране выведено:", type(values))
##################################################
print('4. Что будет выведено на экран в результате '
      'выполнения данной программы:')
print('     values=(1,2,3,4,5,6)')
print('     values=list(values)')
print('     print(type(values)) ?')
values=(1,2,3,4,5,6)
values=list(values)
print("4. На экране выведено:", type(values))
##################################################
print('5. Что будет выведено на экран в результате '
      'выполнения данной программы:')
print('     values=[1,2,3,4,5,6]')
print('     values=tuple(values)')
print('     print(type(values)) ?')
values=[1,2,3,4,5,6]
values=tuple(values)
print("5. На экране выведено:", type(values))
##################################################
print('6. Что будет выведено на экран в результате '
      'выполнения данной программы:')
print('     values=[1,2,3,4,5,6]')
print('     result=[]')
print('for value in values:')
print('     result.append(value)')
print("     result ?")
values=[1,2,3,4,5,6]
result=[]
for value in values:
    result.append(value)
print("6. На экране выведено:", result)
#########################
#########################
#########################
#########################
#########################
#########################
#########################
#########################
#########################
#########################
#########################
